title: "Possible FileUpload or FileDownload via CertReq.exe"
description: |
    This analytic looks for the use of certreq, a LOLBIN capable of file upload or download to or from a remote host.
    

rank: Highest
tags: 
    - attack.T1105
author: "Andrew Danis"
references: 
    - "https://lolbas-project.github.io/lolbas/Binaries/Certreq/#download "
logsource:
    category: process_creation
detection: 
    condition: Section_1
    Section_1:
        CommandLine|contains|all:
            - '-post'
            - '-config'
        Image|endswith: \certreq.exe
