title: "Possible Windows Defender Bypass Techniques"
description: |
    This analytic looks for common methodology to bypass Windows Defender. False positives could include legitimate administrative activity. 
    

rank: High
tags: 
    - attack.T1086
    - attack.T1089
author: "Andrew Danis"
references: 
    - "https://github.com/swagkarna/Defeat-Defender/blob/main/Defeat-Defender.bat"
    - "https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2019-ps"
logsource:
    category: process_creation
detection: 
    condition: 'Section_1 OR Section_2 '
    Section_1:
        CommandLine|contains:
            - icacls "%systemroot%\System32\smartscreen.exe" /reset
            - taskkill /im smartscreen.exe /f
            - >-
                icacls "%systemroot%\System32\smartscreen.exe" /inheritance:r
                /remove
    Section_2:
        Image|endswith: \powershell.exe
        CommandLine|contains:
            - Add-MpPreference -ExclusionExtension ".exe"
            - Set-MpPreference -EnableControlledFolderAccess Disabled
            - Set-MpPreference -PUAProtection disable
            - Set-MpPreference -DisableRealtimeMonitoring $true
            - Set-MpPreference -DisableBehaviorMonitoring $tru
            - Set-MpPreference -DisableIOAVProtection $true
            - Set-MpPreference -DisablePrivacyMode $tru
            - Set-MpPreference -SignatureDisableUpdateOnStartupWithoutEngine $true
            - Set-MpPreference -DisableArchiveScanning $true
            - Set-MpPreference -DisableIntrusionPreventionSystem $true
            - Set-MpPreference -DisableScriptScanning $true
            - Set-MpPreference -SubmitSamplesConsent 2
            - Set-MpPreference -MAPSReporting 0
            - Set-MpPreference -HighThreatDefaultAction 6 -Force
            - Set-MpPreference -ModerateThreatDefaultAction 6
            - Set-MpPreference -LowThreatDefaultAction 6
            - Set-MpPreference -SevereThreatDefaultAction 6
            - Set-MpPreference -ScanScheduleDay 8
