title: Possible Code Injection Attempt via Discord LOLBIN
description: |
    This rule looks for possible code injection via a legitimate Discord binary, discordhookhelper64.exe. 
    

rank: High
tags: 
    - attack.T1055
author: "Andrew Danis <andrew.danis@nih.gov>"
references: 
    - "https://twitter.com/Blackmond_/status/1317035680682397701"
logsource:
    category: process_creation
detection: 
    condition: Section_1 and not filter
    Section_1:
        CommandLine|contains: discordhookhelper64.exe inject
    filter:
        ParentImage: '*\discord.exe'
