title: Renamed NetSupport RAT Execution
description: |
  This analytic looks for the execution of a renamed NetSupport RAT binary. This could be used for defense evasion and remote control of a compromised system.
level: high
status: stable
tags:
- attack.T1219
- attack.T1036.003
author: Andrew Danis
references:
- 'https://redcanary.com/blog/misbehaving-rats/'
logsource:
  category: process_creation
  product: windows
detection:
  condition: 'Section_1 AND NOT (Section_2 OR Section_3 ) '
  Section_1:
    OriginalFileName: client32.exe
    Description: NetSupport Client Application
  Section_2:
    ProcessName: client32.exe
  Section_3:
    Image|endswith: \client32.exe
falsepositives:
- 'Legitimate of the NetSupport Remote Administration Tool in your environment. However, renaming the binary would be considered suspicious.'
