title: "Suspicious Process Creation - winapiexec"
description: |
    winapiexec is a binary that lets you run Windows API's and shellcode from a command line or batch script. This has been seen used by Gamaredon group in the past.
    

rank: Highest
tags: 
    - attack.T1106
author: "Andrew Danis"
references: 
    - "https://twitter.com/arekfurt/status/1276338766307885057"
    - "https://rammichael.com/winapiexec"
logsource:
    category: process_creation
detection: 
    condition: 'Section_1 OR Section_2 '
    Section_1:
        CommandLine|contains: winapiexec
    Section_2:
        Image|contains: winapiexec
    
