title: System Shells via Services
description: |
    Windows services typically run as SYSTEM and can be used as a privilege escalation opportunity. Malware or penetration testers may run a shell as a service to gain SYSTEM permissions.
rank: Medium
tags: 
    - persistence
    - system shell
    - attack.T1050
author: Andrew Danis
references: 
    - "https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_system_shells_via_services.toml"
logsource:
    category: process_creation
detection: 
    condition: Section_1
    Section_1:
        ParentImage: '*services.exe'
        Image:
            - '*powershell.exe'
            - '*cmd.exe'
    
