title: "Sticky Key Like Backdoor Usage - via Registry Change"
description: |
    This analytic detects the usage and installation of a backdoor that uses an option to register a malicious debugger for built-in tools that are accessible in the login screen. Taken from the PolyLogyX detection repo and modified for universal use.
    

rank: Highest
tags: 
    - attack.T1015
author: PolyLogyx
references: 
    - "https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/"
    - "https://github.com/polylogyx/DetectionRules/blob/master/general/stickykey_like_backdoor.yml"
logsource:
    category: registry_value_change
detection: 
    condition: Section_1
    Section_1:
        TargetObject:
            - >-
                *\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution
                Options\sethc.exe\Debugger
            - >-
                *\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution
                Options\utilman.exe\Debugger
            - >-
                *\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution
                Options\osk.exe\Debugger
            - >-
                *\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution
                Options\Magnify.exe\Debugger
            - >-
                *\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution
                Options\Narrator.exe\Debugger
            - >-
                *\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution
                Options\DisplaySwitch.exe\Debugger
