title: "Suspicious Program Location with Network Connections"
description: |
    This analytic detects programs with network connections running in suspicious files system locations. Taken from the PolyLogyX detection repo and modified for universal use.
    

rank: Medium
tags: 
    - attack.T1036
author: "Andrew Danis"
references: 
    - "https://docs.google.com/spreadsheets/d/17pSTDNpa0sf6pHeRhusvWG6rThciE8CsXTSlDUAZDyo"
logsource:
    category: network_connection
detection: 
    condition: selection
    selection:
        Image|contains:
            - '*\$Recycle.bin'
            - '*\Users\All Users\\*'
            - '*\Users\Default\\*'
            - '*\Users\Public\\*'
            - 'C:\Perflogs\\*'
            - '*\config\systemprofile\\*'
            - '*\Windows\Fonts\\*'
            - '*\Windows\IME\\*'
            - '*\Windows\addins\\*'
